Revit 2027 API
ParameterFilterRuleFactory.CreateNotEqualsRule(ElementId, Double, Double) Method
 Creates a filter rule that determines whether double-precision values from the document do not equal a certain value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateNotEqualsRule(
	ElementId parameter,
	double value,
	double epsilon
)
Public Shared Function CreateNotEqualsRule (
	parameter As ElementId,
	value As Double,
	epsilon As Double
) As FilterRule
public:
static FilterRule^ CreateNotEqualsRule(
	ElementId^ parameter,
	double value,
	double epsilon
)
static member CreateNotEqualsRule :
        parameter : ElementId *
        value : float *
        epsilon : float -> FilterRule
Parameters
parameter ElementId
 A double-typed parameter used to get values from the document for a given element.
value Double
 The user-supplied value against which values from the document will be compared.
epsilon Double
 Defines the tolerance within which two values may be considered equal.
Return Value
FilterRule
Exceptions
Exception | Condition
ArgumentException |  The given value for value is not finite -or- The given value for value is not a number -or- The given value for epsilon is not finite -or- The given value for epsilon is not a number
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterRuleFactory Class
CreateNotEqualsRule Overload
Autodesk.Revit.DB Namespace